; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content)(not(box-has ?box ?content)))
    )
)

; problem
(define (problem drone_problem_d1_l19_p19_c19_g19)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 refugio8 refugio9 refugio10 refugio11 refugio12 refugio13 refugio14 refugio15 refugio16 refugio17 refugio18 refugio19 - location
	box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 person8 person9 person10 person11 person12 person13 person14 person15 person16 person17 person18 person19 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 comida)
	(at-box box4 deposito)
	(box-has box4 comida)
	(at-box box5 deposito)
	(box-has box5 comida)
	(at-box box6 deposito)
	(box-has box6 comida)
	(at-box box7 deposito)
	(box-has box7 comida)
	(at-box box8 deposito)
	(box-has box8 comida)
	(at-box box9 deposito)
	(box-has box9 comida)
	(at-box box10 deposito)
	(box-has box10 comida)
	(at-box box11 deposito)
	(box-has box11 comida)
	(at-box box12 deposito)
	(box-has box12 medicina)
	(at-box box13 deposito)
	(box-has box13 medicina)
	(at-box box14 deposito)
	(box-has box14 medicina)
	(at-box box15 deposito)
	(box-has box15 medicina)
	(at-box box16 deposito)
	(box-has box16 medicina)
	(at-box box17 deposito)
	(box-has box17 medicina)
	(at-box box18 deposito)
	(box-has box18 medicina)
	(at-box box19 deposito)
	(box-has box19 medicina)
	(at-person person1 refugio2)
	(at-person person2 refugio13)
	(at-person person3 refugio3)
	(at-person person4 refugio10)
	(at-person person5 refugio6)
	(at-person person6 refugio10)
	(at-person person7 refugio19)
	(at-person person8 refugio2)
	(at-person person9 refugio13)
	(at-person person10 refugio8)
	(at-person person11 refugio13)
	(at-person person12 refugio1)
	(at-person person13 refugio10)
	(at-person person14 refugio1)
	(at-person person15 refugio8)
	(at-person person16 refugio19)
	(at-person person17 refugio9)
	(at-person person18 refugio3)
	(at-person person19 refugio3)
)

(:goal (and
	(person-has person1 medicina)
	(person-has person2 comida)
	(person-has person3 medicina)
	(person-has person4 comida)
	(person-has person5 medicina)
	(person-has person6 medicina)
	(person-has person8 comida)
	(person-has person8 medicina)
	(person-has person9 comida)
	(person-has person10 comida)
	(person-has person11 comida)
	(person-has person12 comida)
	(person-has person14 comida)
	(person-has person14 medicina)
	(person-has person15 medicina)
	(person-has person16 comida)
	(person-has person16 medicina)
	(person-has person17 comida)
	(person-has person18 comida)
))
)

; plan
1. (pick box19 deposito dron1-der dron1)
   deleted: (at-box box19 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box19)
   goals met: 0 of 19
2. (pick box11 deposito dron1-izq dron1)
   deleted: (at-box box11 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box11)
   goals met: 0 of 19
3. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 0 of 19
4. (leave box19 refugio6 dron1-der dron1 person5 medicina)
   deleted: (carrying dron1 dron1-der box19) (box-has box19 medicina)
   added: (at-box box19 refugio6) (free dron1-der) (person-has person5 medicina)
   goals met: 1 of 19
5. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 1 of 19
6. (pick box18 deposito dron1-der dron1)
   deleted: (at-box box18 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box18)
   goals met: 1 of 19
7. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 1 of 19
8. (move refugio10 refugio9 dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 refugio9)
   goals met: 1 of 19
9. (leave box11 refugio9 dron1-izq dron1 person17 comida)
   deleted: (carrying dron1 dron1-izq box11) (box-has box11 comida)
   added: (at-box box11 refugio9) (free dron1-izq) (person-has person17 comida)
   goals met: 2 of 19
10. (move refugio9 deposito dron1)
   deleted: (at-dron dron1 refugio9)
   added: (at-dron dron1 deposito)
   goals met: 2 of 19
11. (pick box10 deposito dron1-izq dron1)
   deleted: (at-box box10 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box10)
   goals met: 2 of 19
12. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 2 of 19
13. (leave box10 refugio10 dron1-izq dron1 person4 comida)
   deleted: (carrying dron1 dron1-izq box10) (box-has box10 comida)
   added: (at-box box10 refugio10) (free dron1-izq) (person-has person4 comida)
   goals met: 3 of 19
14. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 3 of 19
15. (pick box9 deposito dron1-izq dron1)
   deleted: (at-box box9 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box9)
   goals met: 3 of 19
16. (move deposito refugio10 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio10)
   goals met: 3 of 19
17. (leave box18 refugio10 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box18) (box-has box18 medicina)
   added: (at-box box18 refugio10) (free dron1-der) (person-has person6 medicina)
   goals met: 4 of 19
18. (move refugio10 deposito dron1)
   deleted: (at-dron dron1 refugio10)
   added: (at-dron dron1 deposito)
   goals met: 4 of 19
19. (pick box17 deposito dron1-der dron1)
   deleted: (at-box box17 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box17)
   goals met: 4 of 19
20. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 4 of 19
21. (leave box17 refugio2 dron1-der dron1 person1 medicina)
   deleted: (carrying dron1 dron1-der box17) (box-has box17 medicina)
   added: (at-box box17 refugio2) (free dron1-der) (person-has person1 medicina)
   goals met: 5 of 19
22. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 5 of 19
23. (pick box16 deposito dron1-der dron1)
   deleted: (at-box box16 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box16)
   goals met: 5 of 19
24. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 5 of 19
25. (leave box9 refugio2 dron1-izq dron1 person8 comida)
   deleted: (carrying dron1 dron1-izq box9) (box-has box9 comida)
   added: (at-box box9 refugio2) (free dron1-izq) (person-has person8 comida)
   goals met: 6 of 19
26. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 6 of 19
27. (pick box8 deposito dron1-izq dron1)
   deleted: (at-box box8 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box8)
   goals met: 6 of 19
28. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 6 of 19
29. (leave box16 refugio2 dron1-der dron1 person8 medicina)
   deleted: (carrying dron1 dron1-der box16) (box-has box16 medicina)
   added: (at-box box16 refugio2) (free dron1-der) (person-has person8 medicina)
   goals met: 7 of 19
30. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 7 of 19
31. (pick box15 deposito dron1-der dron1)
   deleted: (at-box box15 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box15)
   goals met: 7 of 19
32. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 7 of 19
33. (leave box8 refugio13 dron1-izq dron1 person2 comida)
   deleted: (carrying dron1 dron1-izq box8) (box-has box8 comida)
   added: (at-box box8 refugio13) (free dron1-izq) (person-has person2 comida)
   goals met: 8 of 19
34. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 8 of 19
35. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 8 of 19
36. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 8 of 19
37. (leave box7 refugio13 dron1-izq dron1 person9 comida)
   deleted: (carrying dron1 dron1-izq box7) (box-has box7 comida)
   added: (at-box box7 refugio13) (free dron1-izq) (person-has person9 comida)
   goals met: 9 of 19
38. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 9 of 19
39. (pick box6 deposito dron1-izq dron1)
   deleted: (at-box box6 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box6)
   goals met: 9 of 19
40. (move deposito refugio13 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio13)
   goals met: 9 of 19
41. (leave box6 refugio13 dron1-izq dron1 person11 comida)
   deleted: (carrying dron1 dron1-izq box6) (box-has box6 comida)
   added: (at-box box6 refugio13) (free dron1-izq) (person-has person11 comida)
   goals met: 10 of 19
42. (move refugio13 deposito dron1)
   deleted: (at-dron dron1 refugio13)
   added: (at-dron dron1 deposito)
   goals met: 10 of 19
43. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 10 of 19
44. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 10 of 19
45. (leave box5 refugio1 dron1-izq dron1 person12 comida)
   deleted: (carrying dron1 dron1-izq box5) (box-has box5 comida)
   added: (at-box box5 refugio1) (free dron1-izq) (person-has person12 comida)
   goals met: 11 of 19
46. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 11 of 19
47. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 11 of 19
48. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 11 of 19
49. (leave box4 refugio1 dron1-izq dron1 person14 comida)
   deleted: (carrying dron1 dron1-izq box4) (box-has box4 comida)
   added: (at-box box4 refugio1) (free dron1-izq) (person-has person14 comida)
   goals met: 12 of 19
50. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 12 of 19
51. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 12 of 19
52. (move deposito refugio1 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio1)
   goals met: 12 of 19
53. (leave box15 refugio1 dron1-der dron1 person14 medicina)
   deleted: (carrying dron1 dron1-der box15) (box-has box15 medicina)
   added: (at-box box15 refugio1) (free dron1-der) (person-has person14 medicina)
   goals met: 13 of 19
54. (move refugio1 deposito dron1)
   deleted: (at-dron dron1 refugio1)
   added: (at-dron dron1 deposito)
   goals met: 13 of 19
55. (pick box14 deposito dron1-der dron1)
   deleted: (at-box box14 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box14)
   goals met: 13 of 19
56. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 13 of 19
57. (leave box3 refugio8 dron1-izq dron1 person10 comida)
   deleted: (carrying dron1 dron1-izq box3) (box-has box3 comida)
   added: (at-box box3 refugio8) (free dron1-izq) (person-has person10 comida)
   goals met: 14 of 19
58. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 14 of 19
59. (pick box2 deposito dron1-izq dron1)
   deleted: (at-box box2 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box2)
   goals met: 14 of 19
60. (move deposito refugio8 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio8)
   goals met: 14 of 19
61. (leave box14 refugio8 dron1-der dron1 person15 medicina)
   deleted: (carrying dron1 dron1-der box14) (box-has box14 medicina)
   added: (at-box box14 refugio8) (free dron1-der) (person-has person15 medicina)
   goals met: 15 of 19
62. (move refugio8 deposito dron1)
   deleted: (at-dron dron1 refugio8)
   added: (at-dron dron1 deposito)
   goals met: 15 of 19
63. (pick box13 deposito dron1-der dron1)
   deleted: (at-box box13 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box13)
   goals met: 15 of 19
64. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 15 of 19
65. (leave box2 refugio19 dron1-izq dron1 person16 comida)
   deleted: (carrying dron1 dron1-izq box2) (box-has box2 comida)
   added: (at-box box2 refugio19) (free dron1-izq) (person-has person16 comida)
   goals met: 16 of 19
66. (move refugio19 deposito dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 deposito)
   goals met: 16 of 19
67. (pick box1 deposito dron1-izq dron1)
   deleted: (at-box box1 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box1)
   goals met: 16 of 19
68. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 16 of 19
69. (move refugio19 refugio3 dron1)
   deleted: (at-dron dron1 refugio19)
   added: (at-dron dron1 refugio3)
   goals met: 16 of 19
70. (leave box1 refugio3 dron1-izq dron1 person18 comida)
   deleted: (carrying dron1 dron1-izq box1) (box-has box1 comida)
   added: (at-box box1 refugio3) (free dron1-izq) (person-has person18 comida)
   goals met: 17 of 19
71. (leave box13 refugio3 dron1-der dron1 person3 medicina)
   deleted: (carrying dron1 dron1-der box13) (box-has box13 medicina)
   added: (at-box box13 refugio3) (free dron1-der) (person-has person3 medicina)
   goals met: 18 of 19
72. (move refugio3 deposito dron1)
   deleted: (at-dron dron1 refugio3)
   added: (at-dron dron1 deposito)
   goals met: 18 of 19
73. (pick box12 deposito dron1-der dron1)
   deleted: (at-box box12 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box12)
   goals met: 18 of 19
74. (move deposito refugio19 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio19)
   goals met: 18 of 19
75. (leave box12 refugio19 dron1-der dron1 person16 medicina)
   deleted: (carrying dron1 dron1-der box12) (box-has box12 medicina)
   added: (at-box box12 refugio19) (free dron1-der) (person-has person16 medicina)
   goals met: 19 of 19
